
export function getText(label) {
    const lang = localStorage.getItem('lang');
    if (lang) {
        return label[lang]
    }
    return label.ru
}

export const lang = {
    about: {
        me: {
            ru: "О нас",
            kz: "Біз туралы"
        },
        mission: {
            ru: "LingCard - это проект, который помогает людям учить языки с помощью простых интерактивных карточек.\n" +
                "Наша миссия - сделать изучение языков доступным, увлекательным и эффективным для каждого.",
            kz: "LingCard — бұл адамдарға қарапайым интерактивті карточкалар арқылы тіл үйренуге көмектесетін жоба.\n" +
                "Біздің миссиямыз — тіл үйренуді әркімге қолжетімді, қызықты әрі тиімді ету."
        },
        contacts: {
            ru: "Контакты",
            kz: "Байланыс ақпараты"
        },
        languages: {
            ru: "Доступные слова",
            kz: "Қолжетімді тілдер"
        }
    },
    back: {
        button: {
            ru: "Назад",
            kz: "Артқа"
        }
    },
    navbar: {
        options: {
            training: {
                ru: "Тренировка",
                kz: "Жаттығу"
            },
            progress: {
                ru: "Прогресс",
                kz: "Прогресс"
            },
            dictionary: {
                ru: "Словарь",
                kz: "Сөздік"
            },
            about: {
                ru: "О нас",
                kz: "Біз туралы"
            }
        }
    },
    profileBar: {
        signIn: {
            ru: "Войти",
            kz: "Кіру"
        },
        guest: {
            ru: "Гость",
            kz: "Қонақ"
        }
    },
    login: {
        mainLabel: {
            ru: "Вход в систему",
            kz: "Жүйеге кіру"
        },
        invalidCredentials: {
            ru: "Неправильный логин и/или пароль",
            kz: "Пайдаланушы аты немесе құпия сөз дұрыс емес"
        },
        email: {
            ru: "Эл. почта",
            kz: "Электрондық пошта"
        },
        password: {
            ru: "Пароль",
            kz: "Құпиясөз"
        },
        signIn: {
            ru: "Войти",
            kz: "Кіру"
        },
        noAccount: {
            ru: "Нет аккаунта?",
            kz: "Аккаунтыңыз жоқ па?"
        },
        signUp: {
            ru: "Зарегистрироваться",
            kz: "Тіркелу"
        }
    },
    register: {
        registerLabel: {
            ru: "Регистрация",
            kz: "Тіркелу"
        },
        email: {
            ru: "Эл. почта",
            kz: "Электрондық пошта"
        },
        username: {
            ru: "Имя пользователя",
            kz: "Пайдаланушы аты"
        },
        password: {
            ru: "Пароль",
            kz: "Құпиясөз"
        },
        baseLang: {
            ru: "Базовый язык",
            kz: "Негізгі тіл"
        },
        targetLang: {
            ru: "Язык изучения",
            kz: "Оқылатын тіл"
        },
        createAccount: {
            ru: "Создать аккаунт",
            kz: "Аккаунт жасау"
        },
        success: {
            ru: "Аккаунт создан успешно!",
            kz: "Аккаунт сәтті құрылды!"
        },
        failed: {
            ru: "Ошибка создания аккаунта!",
            kz: "Аккаунт құру қатесі!"
        }
    },
    dictionary: {
        dictionary: {
            ru: "Словарь",
            kz: "Сөздік"
        },
        lang1: {
            ru: "Язык 1",
            kz: "1-тіл"
        },
        lang2: {
            ru: "Язык 2",
            kz: "2-тіл"
        },
        show: {
            ru: "Показать",
            kz: "Көрсету"
        },
        chooseLabel: {
            ru: "Выберите языки и нажмите \"Показать\"",
            kz: "Тілдерді таңдап, \"Көрсету\" батырмасын басыңыз"
        },
        prev: {
            ru: "Пред.",
            kz: "Алд."
        },
        next: {
            ru: "След.",
            kz: "Келесі"
        },
        words: {
            ru: "Слова",
            kz: "Сөздер"
        },
        searchPlaceholder: {
            ru: "Поиск по слову (на базовом языке)",
            kz: "Сөз бойынша іздеу (негізгі тілде)"
        }
    },
    home: {
        news: {
            ru: "Новости",
            kz: "Жаңалықтар"
        }
    },
    selectedLanguage: {
        loading: {
            ru: "Загрузка...",
            kz: "Жүктелуде..."
        },
        errorLoading: {
            ru: "Ошибка загрузки",
            kz: "Жүктеу қатесі"
        },
        chooseLanguage: {
            ru: "Выберите язык...",
            kz: "Тілді таңдаңыз..."
        }
    },
    protectedRoute: {
        loading: {
            ru: "Загрузка...",
            kz: "Жүктелуде..."
        }
    },
    unprotectedRoute: {
        loading: {
            ru: "Загрузка...",
            kz: "Жүктелуде..."
        }
    },
    word: {
        clearProgress: {
            ru: "Сбросить прогресс",
            kz: "Прогресті қалпына келтіру"
        }
    },
    profile: {
        error: {
            sameLanguages: {
                ru: "Базовый язык и язык изучения не могут быть одинаковыми",
                kz: "Негізгі тіл мен оқылатын тіл бірдей бола алмайды"
            },
            bothLanguages: {
                ru: "Пожалуйста, выберите оба языка",
                kz: "Екі тілді де таңдаңыз"
            },
            notChanged: {
                ru: "Языки не были изменены",
                kz: "Тілдер өзгертілмеді"
            },
            failedUpdate: {
                ru: "Ошибка при обновлении настроек",
                kz: "Параметрлерді жаңарту кезінде қате орын алды"
            }
        },
        success: {
            successChanged: {
                ru: "Настройки успешно обновлены!",
                kz: "Параметрлер сәтті жаңартылды!"
            }
        },
        profileLabel: {
            ru: "Профиль",
            kz: "Профиль"
        },
        baseLang: {
            ru: "Базовый язык",
            kz: "Негізгі тіл"
        },
        targetLang: {
            ru: "Язык изучения",
            kz: "Оқылатын тіл"
        },
        noChanged: {
            ru: "Нет изменений",
            kz: "Өзгеріс жоқ"
        },
        buttonChange: {
            ru: "Изменить",
            kz: "Өзгерту"
        },
        stats: {
            ru: "Статистика",
            kz: "Статистика"
        },
        alreadyLearned: {
            ru: "Выучено слов",
            kz: "Үйренген сөздер"
        },
        learning: {
            ru: "Слов изучается",
            kz: "Оқылып жатқан сөздер"
        },
        noLearning: {
            ru: "Ещё не изучено",
            kz: "Әлі үйренілмеген"
        },
        signOut: {
            ru: "Выйти",
            kz: "Шығу"
        },
        clearProgress: {
            ru: "Сбросить прогресс",
            kz: "Прогресті қалпына келтіру"
        }
    },
    progress: {
        newWords: {
            ru: "Новые слова",
            kz: "Жаңа сөздер"
        },
        learningWords: {
            ru: "Изучаемые слова",
            kz: "Оқылып жатқан сөздер"
        },
        learnedWords: {
            ru: "Изученные слова",
            kz: "Үйренген сөздер"
        },
        progressLabel: {
            ru: "Прогресс",
            kz: "Прогресс"
        },
        chooseLabel: {
            ru: "Выберите языки и нажмите \"Показать\"",
            kz: "Тілдерді таңдап, \"Көрсету\" батырмасын басыңыз"
        },
        noWords: {
            ru: "Нет слов",
            kz: "Сөздер жоқ"
        },
        words: {
            ru: "Слова",
            kz: "Сөздер"
        },
        prev: {
            ru: "Пред.",
            kz: "Алд."
        },
        next: {
            ru: "След.",
            kz: "Келесі"
        }
    },
    initWindows: {
        start: {
            ru: "Начать обучение",
            kz: "Оқуды бастау"
        }
    },
    training: {
        loading: {
            ru: "Загрузка...",
            kz: "Жүктелуде..."
        },
        unknown: {
            ru: "Не знаю",
            kz: "Білмеймін"
        },
        show: {
            ru: "Показать",
            kz: "Көрсету"
        },
        known: {
            ru: "Знаю",
            kz: "Білемін"
        },
        newWord: {
            ru: "Новое слово",
            kz: "Жаңа сөз"
        },
        amountRepeat: {
            ru: "Повторений: ",
            kz: "Қайталаулар: "
        },
        hide: {
            ru: "Убрать",
            kz: "Жасыру"
        }
    }
}
